/**
 * Часть 2.
 * Дан массив A, нечетной длины N. Каждый элемент в массиве имеет пару с таким же значением, за исключением одного элемента, который остается без пары.
 * Например:
 * A[0] = 3
 * A[1] = 3
 * A[2] = 1
 * A[3] = 2
 * A[4] = 1
 * A[5] = 1
 * A[6] = 2
 * Элементы A[0] и A[1] парные.
 * Элементы A[2] и A[4] парные.
 * Элементы A[3] и A[6] парные.
 * Элемент A[5] со значением 1 не имеет пары.
 * <p>
 * Написать функцию, которая возвращает значение элемента, который не имеет пары.
 * <p>
 * N находится в интервале [1..1 000 000], каждый элемент массива A в интервале [1..1 000 000 000].
 * <p>
 * В идеальном варианте:
 * Вычислительная сложность — O(N), используемая память — O(1).
 * <p>
 * Допустимо:
 * Вычислительная сложность — O(N ln N), используемая память — O(N).
 */


public class PartTwo {

    public void run() {

    }
}
